# Площадь треугольника 📐
# Напишите программу, которая считывает длины двух катетов в прямоугольном треугольнике и выводит его площадь.
# Формула для вычисления площади треугольника: (1/2) * основание * высота

a = float(input())
b = float(input())

area = 0.5 * a * b
print(area)




# Две старушки 👵
# Две старушки идут навстречу друг другу с постоянными скоростями V1 и V2 км/ч.
# Определите, через какое время старушки встретятся, если расстояние между ними равно S км.

s = float(input())
v1 = float(input())
v2 = float(input())

time = s / (v1 + v2)
print(time)




# Обратное число 🙃
num = float(input())
if num != 0:
    reciprocal = 1 / num
    print(reciprocal)
else:
    print("Обратного числа не существует")




# 451 градус по Фаренгейту 🌡️
temp_far = float(input())
temp_cel = 5/9 * (temp_far - 32)
print(temp_cel)




# Dog age 🐶
dog_years = int(input())

if dog_years <= 2:
    human_years = dog_years * 10.5
else:
    human_years = 21 + (dog_years - 2) * 4

print(human_years)



# Первая цифра после точки
num = float(input())
first_decimal_digit = int((num * 10) % 10)
print(first_decimal_digit)



# Дробная часть
num = float(input())
fractional_part = num - int(num)
print(fractional_part)


